worrajak/nRF52840/nRF52840_vault/3_Resources/Refs/main.cpp
/*
 * nRF52840 LoRa P2P Node — Relay Hop + LoRa (SX1262/RFM95) + BLE GPS
 * Node ID: 116
 *
 * Protocol: RadioHead-compatible headers + XOR encryption + CRC16
 * Packet: [TO=0xFF][FROM=116][ID][FLAGS=hop_count][encrypted_payload+CRC16]
 * Payload: N:116|S:seq|T:temp|H:hum|B:bat|LA:lat|LO:lon
 *
 * BLE: phone sends GPS coordinates → node includes in LoRa payload
 * OLED: status + distance/direction to other nodes
 * SPI: software bit-bang using nrf_gpio_* (n-able PINS_COUNT=34 bug)
 * LoRa: SX1262 (command-based SPI) or RFM95/SX1276 (register-based SPI)
 * BME280: optional — uses simulated values if not connected
 */

#include <Arduino.h>
#include <Wire.h>
#include <Adafruit_SSD1306.h>
#include <Adafruit_BME280.h>
#include <stdarg.h>
#include <nrf_gpio.h>
#include <NimBLEDevice.h>
#include <math.h>
#include "rssi_classifier.h"

// ============ RADIO MODULE SELECTION ============
// PlatformIO defines one of these from custom_radio in platformio.ini.
// Fallback keeps direct Arduino builds usable.
#if !defined(USE_SX1262) && !defined(USE_RFM95)
#define USE_SX1262
#endif
#if defined(USE_SX1262) && defined(USE_RFM95)
#error "Select only one radio: USE_SX1262 or USE_RFM95"
#endif

// ============ PIN DEFINITIONS ============
#define STATUS_LED   15   // P0.15
#define UI_BUTTON_PIN 32  // P1.00 / fakeTec D6 (BTN), active LOW
#define UI_PAGE_COUNT 3
#define BUTTON_DEBOUNCE_MS 40
#define LORA_TX_POWER_DBM 12
#define CPU_IDLE_SLEEP_MS 10  // Yield to FreeRTOS System-ON idle; radio/OLED stay on
#ifndef LOW_POWER_IDLE
#define LOW_POWER_IDLE 0
#endif

// OLED I2C
#define OLED_SDA     36   // P1.04
#define OLED_SCL     11   // P0.11

// LoRa SPI — raw GPIO numbers (nrf_gpio_* functions)
// ปรับ pin ตามการต่อสายของแต่ละบอร์ด
#define LORA_MISO     2    // P0.02
#define LORA_SCK      43   // P1.11
#define LORA_MOSI     47   // P1.15
#define LORA_CS       45   // P1.13
#define LORA_RST      9    // P0.09

#ifdef USE_SX1262
#define LORA_IRQ      29   // P0.29 — SX1262 DIO1
#define LORA_BUSY     3    // P0.03 — SX1262 BUSY pin
#endif

#ifdef USE_RFM95
#define LORA_IRQ      29   // P0.29 — RFM95 DIO0
// RFM95 ไม่มี BUSY pin
#endif

// Battery
#define BATTERY_PIN  31   // P0.31
#define VBAT_MV_PER_LSB     0.73242188F
#define VBAT_DIVIDER_COMP   1.73F
#define REAL_VBAT_MV_PER_LSB (VBAT_DIVIDER_COMP * VBAT_MV_PER_LSB)

// ============ NETWORK CONFIG ============
#ifndef NODE_ID
#define NODE_ID 119  // fallback when not built by PlatformIO
#endif
#if NODE_ID < 1 || NODE_ID > 254
#error "NODE_ID must be in range 1..254 (0 and 255 are reserved)"
#endif
#define THIS_NODE_ADDRESS  NODE_ID
#define BROADCAST_ADDRESS  0xFF
#define MAX_MESSAGE_LEN    251
#define TX_INTERVAL        120000UL  // Send this node's status every 2 minutes

// Crypto key (must match STM32 nodes)
static const char* CRYPTO_KEY = "1234567890000000";
#define CRYPTO_KEY_LEN 16

// ============ RELAY / MULTI-HOP CONFIG ============
#define MAX_HOPS              3
#define RELAY_MEMORY_SIZE     10
#define MESSAGE_QUEUE_SIZE    5
#define RSSI_RELAY_THRESHOLD  -100
#define RELAY_CACHE_TTL       300000  // 5 minutes

// FLAGS bits in RadioHead header byte [3]
#define FLAG_HOP_MASK         0x0F
#define FLAG_IS_ACK           (1 << 4)
#define FLAG_ACK_REQ          (1 << 5)

// Adaptive radio: TX power + SF based on RSSI
// กฎ กสทช. 920-925 MHz: ≤ 500 mW EIRP (~27 dBm) — module HW limit +22 dBm ปลอดภัย
#define ADAPTIVE_POWER_MIN     7    // dBm — RSSI ≥ -75
#define ADAPTIVE_POWER_MED     10   // dBm — RSSI -75 to -90
#define ADAPTIVE_POWER_HIGH    14   // dBm — RSSI -90 to -105
#define ADAPTIVE_POWER_MAX     17   // dBm — RSSI < -105

#define ADAPTIVE_SF_GOOD       7    // RSSI ≥ -75
#define ADAPTIVE_SF_FAIR       8    // RSSI -75 to -90
#define ADAPTIVE_SF_WEAK       10   // RSSI -90 to -105
#define ADAPTIVE_SF_POOR       12   // RSSI < -105

bool adaptiveRadio = true;
uint8_t currentTxPower = LORA_TX_POWER_DBM;
uint8_t currentSF = 7;

// ACK feedback + silence timeout for adaptive power
bool lastTxAcked = false;       // TX ครั้งก่อนมี ACK กลับ?
uint32_t lastHeardTime = 0;    // ms — ครั้งสุดท้ายที่ได้ยิน packet ใด ๆ
#define SILENCE_TIMEOUT_MS 300000  // 5 นาที เงียบ → ส่งแรงสุด
#define PROBE_INTERVAL     10      // ทุก 10th TX ส่งแรงสุดเพื่อประกาศตัว

// RSSI-based forwarding delay table (best relay sends first)
#define RSSI_DELAY_GOOD       200    // ≥ -75 dBm
#define RSSI_DELAY_FAIR       700    // -75 to -90
#define RSSI_DELAY_WEAK       1500   // -90 to -105
#define RSSI_DELAY_POOR       3000   // < -105
#define RSSI_SOURCE_CLOSE_INIT -100  // initial threshold
#define RSSI_EMA_ALPHA_NUM    3     // EMA numerator   (α = 0.3)
#define RSSI_EMA_ALPHA_DEN    10    // EMA denominator

// ML mode toggle — default ON
bool mlMode = true;
uint8_t mlProbPct = 50;  // last ML probability in % (0-100)

// Path success rate (Bayesian)
#define PATH_STATS_SIZE       8
#define BAYES_PRIOR           1     // Laplace smoothing prior

// ============ BLE GPS CONFIG ============
#define BLE_GPS_SERVICE_UUID        "12345678-1234-1234-1234-123456789abc"
#define BLE_GPS_CHAR_UUID           "12345678-1234-1234-1234-123456789abd"
#define BLE_DATA_CHAR_UUID          "12345678-1234-1234-1234-123456789abe"
#define MAX_TRACKED_NODES           8
#define NODE_POSITION_TTL           120000  // 2 min stale timeout

// ============ RSSI DATA LOGGING (for ML training) ============
#define RSSI_LOG_SIZE            512   // circular buffer, ~8KB RAM
#define RSSI_LOG_FLAG_ACK        0x80
#define RSSI_LOG_FLAG_RELAYED    0x40
#define RSSI_LOG_FLAG_CRC_FAIL   0x10  // CRC failed, header-only log

struct RssiSample {
    uint32_t timestamp;   // ms since boot
    uint8_t  nodeId;      // THIS_NODE (who logged this)
    uint8_t  srcNode;     // original source (from payload or header)
    uint8_t  rhFrom;      // who actually sent this packet (relay or origin)
    uint8_t  hopCount;    // 0-3
    int16_t  rssi;        // dBm
    int16_t  snr;         // dB (if available)
    uint8_t  decision;    // RELAY_STATUS_* enum
    uint8_t  flags;       // ACK/RELAYED/CRC_FAIL
} __attribute__((packed));

#define RELAY_STATUS_IDLE     0
#define RELAY_STATUS_QUEUED   1
#define RELAY_STATUS_SENT     2
#define RELAY_STATUS_CANCEL   3
#define RELAY_STATUS_NO_RELAY 4
#define RELAY_STATUS_DROP_DUP 5
#define RELAY_STATUS_DROP_Q   6
#define RELAY_STATUS_DROP_HOP 7
#define RELAY_STATUS_DROP_CRC 8
#define RELAY_STATUS_DROP_ECHO 9
#define RELAY_STATUS_ACK_RCVD 10

RssiSample rssiLog[RSSI_LOG_SIZE];
uint16_t rssiLogHead = 0;
uint16_t rssiLogCount = 0;
#ifndef DEG_TO_RAD
#define DEG_TO_RAD  0.017453292519943295
#endif
#ifndef RAD_TO_DEG
#define RAD_TO_DEG  57.29577951308232
#endif
#define EARTH_RADIUS_M              6371000.0

// ============ GLOBALS ============
Adafruit_SSD1306 display(128, 64, &Wire, -1);
Adafruit_BME280 bme;

