worrajak/nRF52840/nRF52840_vault/3_Resources/Refs/main.cpp
bool initBLE() {
    dbg("BLE: starting...");
    updateOLED();

    char name[20];
    snprintf(name, sizeof(name), "LoRa-N%d", THIS_NODE_ADDRESS);

    if (!NimBLEDevice::init(name)) {
        dbg("BLE: init FAIL");
        return false;
    }
    NimBLEDevice::setPower(3);  // +3 dBm

    // Disable bonding/pairing — prevents "peer remove pairing" errors
    NimBLEDevice::setSecurityAuth(false, false, false);
    NimBLEDevice::setSecurityIOCap(BLE_HS_IO_NO_INPUT_OUTPUT);
    NimBLEDevice::deleteAllBonds();

    dbgf("BLE: name=%s", name);

    NimBLEServer* pServer = NimBLEDevice::createServer();
    if (!pServer) {
        dbg("BLE: server FAIL");
        return false;
    }
    pServer->setCallbacks(&serverCallbacks);

    NimBLEService* pService = pServer->createService(BLE_GPS_SERVICE_UUID);
    NimBLECharacteristic* pChar = pService->createCharacteristic(
        BLE_GPS_CHAR_UUID,
        NIMBLE_PROPERTY::WRITE | NIMBLE_PROPERTY::WRITE_NR
    );
    pChar->setCallbacks(&gpsCallbacks);

    // RSSI data export characteristic (READ + WRITE for trigger)
    NimBLECharacteristic* pDataChar = pService->createCharacteristic(
        BLE_DATA_CHAR_UUID,
        NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::WRITE
    );
    pDataChar->setCallbacks(&dataCallbacks);
    pDataChar->setValue("READY");

    pService->start();

    NimBLEAdvertising* pAdv = NimBLEDevice::getAdvertising();
    pAdv->setName(name);
    pAdv->addServiceUUID(BLE_GPS_SERVICE_UUID);
    pAdv->enableScanResponse(true);
    if (!pAdv->start()) {
        dbg("BLE: adv FAIL");
        return false;
    }

    dbg("BLE: advertising");
    return true;
}

// ============ nRF GPIO HELPERS ============
static inline void gpioSet(uint32_t pin)   { nrf_gpio_pin_set(pin); }
static inline void gpioClear(uint32_t pin) { nrf_gpio_pin_clear(pin); }
static inline void gpioWrite(uint32_t pin, bool val) {
    if (val) nrf_gpio_pin_set(pin); else nrf_gpio_pin_clear(pin);
}
static inline uint32_t gpioRead(uint32_t pin) { return nrf_gpio_pin_read(pin); }
static inline void gpioOutput(uint32_t pin) { nrf_gpio_cfg_output(pin); }
static inline void gpioInput(uint32_t pin) {
    nrf_gpio_cfg_input(pin, NRF_GPIO_PIN_NOPULL);
}

// ============ SOFTWARE SPI (bit-bang) ============
uint8_t swSpiTransfer(uint8_t data) {
    uint8_t recv = 0;
    for (int i = 7; i >= 0; i--) {
        gpioWrite(LORA_MOSI, (data >> i) & 1);
        delayMicroseconds(2);
        gpioSet(LORA_SCK);
        delayMicroseconds(2);
        if (gpioRead(LORA_MISO)) recv |= (1 << i);
        gpioClear(LORA_SCK);
        delayMicroseconds(2);
    }
    return recv;
}

// ============================================================
//  RADIO DRIVER — SX1262 (command-based SPI)
// ============================================================
#ifdef USE_SX1262

bool sx1262WaitBusy(uint32_t timeoutMs = 1000) {
    uint32_t start = millis();
    while (gpioRead(LORA_BUSY)) {
        if (millis() - start > timeoutMs) return false;
        delayMicroseconds(100);
    }
    return true;
}

void sx1262WriteCommand(uint8_t opcode, const uint8_t* params, uint8_t numParams) {
    sx1262WaitBusy();
    gpioClear(LORA_CS);
    delayMicroseconds(5);
    swSpiTransfer(opcode);
    for (uint8_t i = 0; i < numParams; i++) {
        swSpiTransfer(params[i]);
    }
    delayMicroseconds(5);
    gpioSet(LORA_CS);
    delayMicroseconds(5);
}

void sx1262ReadCommand(uint8_t opcode, uint8_t* result, uint8_t numBytes) {
    sx1262WaitBusy();
    gpioClear(LORA_CS);
    delayMicroseconds(5);
    swSpiTransfer(opcode);
    swSpiTransfer(0x00);  // NOP status byte
    for (uint8_t i = 0; i < numBytes; i++) {
        result[i] = swSpiTransfer(0x00);
    }
    delayMicroseconds(5);
    gpioSet(LORA_CS);
    delayMicroseconds(5);
}

void sx1262WriteRegister(uint16_t addr, uint8_t value) {
    sx1262WaitBusy();
    gpioClear(LORA_CS);
    delayMicroseconds(5);
    swSpiTransfer(0x0D);  // WriteRegister opcode
    swSpiTransfer((addr >> 8) & 0xFF);
    swSpiTransfer(addr & 0xFF);
    swSpiTransfer(value);
    delayMicroseconds(5);
    gpioSet(LORA_CS);
    delayMicroseconds(5);
}

uint8_t sx1262ReadRegister(uint16_t addr) {
    sx1262WaitBusy();
    gpioClear(LORA_CS);
    delayMicroseconds(5);
    swSpiTransfer(0x1D);  // ReadRegister opcode
    swSpiTransfer((addr >> 8) & 0xFF);
    swSpiTransfer(addr & 0xFF);
    swSpiTransfer(0x00);  // NOP status
    uint8_t val = swSpiTransfer(0x00);
    delayMicroseconds(5);
    gpioSet(LORA_CS);
    delayMicroseconds(5);
    return val;
}

void sx1262WriteBuffer(uint8_t offset, const uint8_t* data, uint8_t len) {
    sx1262WaitBusy();
    gpioClear(LORA_CS);
    delayMicroseconds(5);
    swSpiTransfer(0x0E);  // WriteBuffer opcode
    swSpiTransfer(offset);
    for (uint8_t i = 0; i < len; i++) {
        swSpiTransfer(data[i]);
    }
    delayMicroseconds(5);
    gpioSet(LORA_CS);
    delayMicroseconds(5);
}

void sx1262ReadBuffer(uint8_t offset, uint8_t* data, uint8_t len) {
    sx1262WaitBusy();
    gpioClear(LORA_CS);
    delayMicroseconds(5);
    swSpiTransfer(0x1E);  // ReadBuffer opcode
    swSpiTransfer(offset);
    swSpiTransfer(0x00);  // NOP status
    for (uint8_t i = 0; i < len; i++) {
        data[i] = swSpiTransfer(0x00);
    }
    delayMicroseconds(5);
    gpioSet(LORA_CS);
    delayMicroseconds(5);
}

void sx1262SetStandby() {
    uint8_t p = 0x00;  // STDBY_RC
    sx1262WriteCommand(0x80, &p, 1);
}

void sx1262ClearIrqStatus() {
    uint8_t p[2] = {0xFF, 0xFF};
    sx1262WriteCommand(0x02, p, 2);
}

uint16_t sx1262GetIrqStatus() {
    uint8_t buf[2];
    sx1262ReadCommand(0x12, buf, 2);
    return ((uint16_t)buf[0] << 8) | buf[1];
}

#endif // USE_SX1262

// ============================================================
//  RADIO DRIVER — RFM95/SX1276 (register-based SPI)
// ============================================================
#ifdef USE_RFM95

// RFM95 register addresses
#define RFM95_REG_FIFO          0x00
#define RFM95_REG_OPMODE        0x01
#define RFM95_REG_FRF_MSB       0x06
#define RFM95_REG_FRF_MID       0x07
#define RFM95_REG_FRF_LSB       0x08
#define RFM95_REG_PA_CONFIG     0x09
#define RFM95_REG_OCP           0x0B
#define RFM95_REG_LNA           0x0C
#define RFM95_REG_FIFO_ADDR_PTR 0x0D
#define RFM95_REG_FIFO_TX_BASE  0x0E
#define RFM95_REG_FIFO_RX_BASE  0x0F
#define RFM95_REG_FIFO_RX_CURR  0x10
#define RFM95_REG_IRQ_FLAGS     0x12
#define RFM95_REG_RX_NB_BYTES   0x13
#define RFM95_REG_PKT_SNR       0x19
#define RFM95_REG_PKT_RSSI      0x1A
#define RFM95_REG_MODEM_CFG1    0x1D
#define RFM95_REG_MODEM_CFG2    0x1E
#define RFM95_REG_SYMB_TIMEOUT  0x1F
#define RFM95_REG_PREAMBLE_MSB  0x20
#define RFM95_REG_PREAMBLE_LSB  0x21
#define RFM95_REG_PAYLOAD_LEN   0x22
#define RFM95_REG_MODEM_CFG3    0x26
#define RFM95_REG_SYNC_WORD     0x39
#define RFM95_REG_DIO_MAPPING1  0x40
#define RFM95_REG_VERSION       0x42
#define RFM95_REG_PA_DAC        0x4D

