worrajak/nRF52840/nRF52840_vault/3_Resources/Refs/main.cpp
// ============ ADAPTIVE RSSI THRESHOLD (EMA) ============
// Exponential Moving Average: adjusts RSSI_SOURCE_CLOSE based on ambient noise
// α = RSSI_EMA_ALPHA_NUM / RSSI_EMA_ALPHA_DEN (e.g. 3/10 = 0.3)
void updateRssiThreshold(int16_t rssi) {
    rssiSampleCount++;
    if (rssiSampleCount == 1) {
        rssiSourceClose = rssi;
    } else {
        // EMA: new = (1-α)*old + α*sample
        int32_t ema = (int32_t)rssiSourceClose * (RSSI_EMA_ALPHA_DEN - RSSI_EMA_ALPHA_NUM)
                    + (int32_t)rssi * RSSI_EMA_ALPHA_NUM;
        rssiSourceClose = (int16_t)(ema / RSSI_EMA_ALPHA_DEN);
    }
    // Clamp: never go above -80 (too aggressive) or below -120 (too permissive)
    if (rssiSourceClose > -80) rssiSourceClose = -80;
    if (rssiSourceClose < -120) rssiSourceClose = -120;
}

// ============ PATH SUCCESS RATE (Bayesian) ============
// Tracks how often packets from each source node get relayed/ACKed
// Uses Laplace smoothing: P(success) = (success + 1) / (total + 2)

PathStat* getPathStat(uint8_t nodeId) {
    // Find existing or empty slot
    int slot = -1;
    uint32_t oldest = 0xFFFFFFFF;
    for (int i = 0; i < PATH_STATS_SIZE; i++) {
        if (pathStats[i].nodeId == nodeId) return &pathStats[i];
        if (pathStats[i].totalCount < oldest) {
            oldest = pathStats[i].totalCount;
            slot = i;
        }
    }
    if (slot < 0) slot = 0;
    pathStats[slot].nodeId = nodeId;
    pathStats[slot].successCount = 0;
    pathStats[slot].totalCount = 0;
    return &pathStats[slot];
}

void recordPathEvent(uint8_t nodeId, bool success) {
    PathStat* ps = getPathStat(nodeId);
    if (success) {
        ps->successCount++;
    } else {
        ps->totalCount++;  // total event (packet seen)
    }
}

// Record that we saw a packet from this source (total count)
void recordPathSeen(uint8_t nodeId) {
    PathStat* ps = getPathStat(nodeId);
    ps->totalCount++;
}

// Record that this source's packet was successfully relayed/ACKed
void recordPathSuccess(uint8_t nodeId) {
    PathStat* ps = getPathStat(nodeId);
    ps->successCount++;
    // Ensure totalCount >= successCount
    if (ps->successCount > ps->totalCount) ps->totalCount = ps->successCount;
}

// Returns probability 0-100 that a packet from this node will reach GW
uint8_t pathSuccessProbability(uint8_t nodeId) {
    PathStat* ps = getPathStat(nodeId);
    // Laplace smoothed: (success + 1) / (total + 2)
    uint32_t num = (ps->successCount + BAYES_PRIOR) * 100;
    uint32_t den = ps->totalCount + (BAYES_PRIOR * 2);
    return (uint8_t)(num / den);
}

// ============ RSSI DATA LOGGING ============
void logRssiSample(uint8_t srcNode, uint8_t rhFrom, uint8_t hopCount, int16_t rssi,
                   int16_t snr, uint8_t decision, uint8_t flags) {
    rssiLog[rssiLogHead].timestamp = millis();
    rssiLog[rssiLogHead].nodeId = THIS_NODE_ADDRESS;
    rssiLog[rssiLogHead].srcNode = srcNode;
    rssiLog[rssiLogHead].rhFrom = rhFrom;
    rssiLog[rssiLogHead].hopCount = hopCount;
    rssiLog[rssiLogHead].rssi = rssi;
    rssiLog[rssiLogHead].snr = snr;
    rssiLog[rssiLogHead].decision = decision;
    rssiLog[rssiLogHead].flags = flags;
    rssiLogHead = (rssiLogHead + 1) % RSSI_LOG_SIZE;
    if (rssiLogCount < 0xFFFF) rssiLogCount++;
}

// Update last log entry's decision from lastRelayStatus string
void updateLastLogDecision() {
    uint16_t prevIdx = (rssiLogHead == 0) ? RSSI_LOG_SIZE - 1 : rssiLogHead - 1;
    if (strcmp(lastRelayStatus, "QUEUED") == 0)        rssiLog[prevIdx].decision = RELAY_STATUS_QUEUED;
    else if (strcmp(lastRelayStatus, "SENT") == 0)      rssiLog[prevIdx].decision = RELAY_STATUS_SENT;
    else if (strcmp(lastRelayStatus, "CANCEL") == 0)    rssiLog[prevIdx].decision = RELAY_STATUS_CANCEL;
    else if (strcmp(lastRelayStatus, "NO-RELAY") == 0)  rssiLog[prevIdx].decision = RELAY_STATUS_NO_RELAY;
    else if (strcmp(lastRelayStatus, "DROP-DUP") == 0)  rssiLog[prevIdx].decision = RELAY_STATUS_DROP_DUP;
    else if (strcmp(lastRelayStatus, "DROP-Q") == 0)    rssiLog[prevIdx].decision = RELAY_STATUS_DROP_Q;
    else if (strcmp(lastRelayStatus, "DROP-HOP") == 0)  rssiLog[prevIdx].decision = RELAY_STATUS_DROP_HOP;
    else if (strcmp(lastRelayStatus, "DROP-CRC") == 0)  rssiLog[prevIdx].decision = RELAY_STATUS_DROP_CRC;
    else if (strcmp(lastRelayStatus, "DROP-ECHO") == 0) rssiLog[prevIdx].decision = RELAY_STATUS_DROP_ECHO;
    else if (strcmp(lastRelayStatus, "ACK-RCVD") == 0)  rssiLog[prevIdx].decision = RELAY_STATUS_ACK_RCVD;
}

// Dump RSSI log as CSV via Serial
// Format: ts_ms,srcNode,hopCount,rssi,snr,flags
void dumpRssiLog() {
    uint16_t count = (rssiLogCount < RSSI_LOG_SIZE) ? rssiLogCount : RSSI_LOG_SIZE;
    uint16_t start = (rssiLogCount < RSSI_LOG_SIZE) ? 0 :
                     (rssiLogHead % RSSI_LOG_SIZE);
    Serial.println(F("=== RSSI LOG DUMP ==="));
    Serial.println(F("ts_ms,node,src,from,hop,rssi,snr,decision,flags"));
    for (uint16_t i = 0; i < count; i++) {
        uint16_t idx = (start + i) % RSSI_LOG_SIZE;
        RssiSample* s = &rssiLog[idx];
        Serial.print(s->timestamp);
        Serial.print(F(","));
        Serial.print(s->nodeId);
        Serial.print(F(","));
        Serial.print(s->srcNode);
        Serial.print(F(","));
        Serial.print(s->rhFrom);
        Serial.print(F(","));
        Serial.print(s->hopCount);
        Serial.print(F(","));
        Serial.print(s->rssi);
        Serial.print(F(","));
        Serial.print(s->snr);
        Serial.print(F(","));
        Serial.print(s->decision);
        Serial.print(F(","));
        Serial.println(s->flags, HEX);
    }
    Serial.println(F("=== END ==="));
}

// Handle Serial commands
void handleSerialCommand() {
    if (Serial.available() <= 0) return;
    String cmd = Serial.readStringUntil('\n');
    cmd.trim();
    if (cmd == "DATADUMP") {
        dumpRssiLog();
    } else if (cmd == "DATACLEAR") {
        rssiLogHead = 0;
        rssiLogCount = 0;
        dbg("RSSI log cleared");
    } else if (cmd == "STATS") {
        dbgf("RSSI samples: %u", rssiLogCount);
        dbgf("EMA threshold: %d dBm", rssiSourceClose);
        dbgf("ML mode: %s", mlMode ? "ON" : "OFF");
        dbgf("ML last prob: %d%%", mlProbPct);
        dbgf("Adaptive radio: %s", adaptiveRadio ? "ON" : "OFF");
        dbgf("TX power: %d dBm, SF: %d", currentTxPower, currentSF);
        dbgf("Last ACK: %s", lastTxAcked ? "YES" : "NO");
        dbgf("Silence: %lus", (millis() - lastHeardTime) / 1000UL);
    } else if (cmd == "MLTOGGLE") {
        mlMode = !mlMode;
        dbgf("ML mode: %s", mlMode ? "ON" : "OFF");
    } else if (cmd == "MLON") {
        mlMode = true;
        dbg("ML mode: ON");
    } else if (cmd == "MLOFF") {
        mlMode = false;
        dbg("ML mode: OFF");
    } else if (cmd == "ADAPTIVE") {
        adaptiveRadio = !adaptiveRadio;
        dbgf("Adaptive radio: %s", adaptiveRadio ? "ON" : "OFF");
    } else if (cmd == "ADAPTON") {
        adaptiveRadio = true;
        dbg("Adaptive radio: ON");
    } else if (cmd == "ADAPTOFF") {
        adaptiveRadio = false;
        dbg("Adaptive radio: OFF");
    }
}

