worrajak/nRF52840/nRF52840_vault/3_Resources/Refs/main.cpp
    configureLoRaModem();
    setModeRx();
    attachInterrupt(digitalPinToInterrupt(LORA_IRQ), lora_isr, RISING);
    dbgf("SX1262: OK N:%d", THIS_NODE_ADDRESS);
#endif

#ifdef USE_RFM95
    dbg("RFM95: init...");
    updateOLED();
    delay(10);

    // Reset
    dbg("RFM95: reset...");
    updateOLED();
    gpioClear(LORA_RST);
    delay(10);
    gpioSet(LORA_RST);
    delay(10);

    // Set sleep mode first, then LoRa mode
    rfm95WriteReg(RFM95_REG_OPMODE, 0x00);  // FSK sleep
    delay(10);
    rfm95WriteReg(RFM95_REG_OPMODE, RFM95_MODE_SLEEP);  // LoRa sleep
    delay(10);

    // Verify chip — version should be 0x12
    uint8_t ver = rfm95ReadReg(RFM95_REG_VERSION);
    dbgf("RFM95 ver: 0x%02X", ver);
    updateOLED();

    if (ver != 0x12) {
        dbg("RFM95: not found!");
        updateOLED();
        return false;
    }

    rfm95WriteReg(RFM95_REG_OPMODE, RFM95_MODE_STANDBY);
    delay(10);

    configureLoRaModem();
    setModeRx();
    attachInterrupt(digitalPinToInterrupt(LORA_IRQ), lora_isr, RISING);
    dbgf("RFM95: OK N:%d", THIS_NODE_ADDRESS);
#endif

    updateOLED();
    return true;
}

// ============ LORA TX (RadioHead compatible) ============
void sendPacket() {
    if (!lora_ok) return;

    char payload[120];
    if (gpsValid) {
        // Include GPS coordinates (6 decimal places ≈ 0.11m precision)
        char latStr[12], lonStr[12];
        dtostrf(myLat, 1, 6, latStr);
        dtostrf(myLon, 1, 6, lonStr);
        snprintf(payload, sizeof(payload), "N:%d|S:%d|T:%d|H:%d|B:%d|LA:%s|LO:%s",
                 THIS_NODE_ADDRESS, txSequenceNum,
                 temperature, humidity, batteryMV, latStr, lonStr);
    } else {
        snprintf(payload, sizeof(payload), "N:%d|S:%d|T:%d|H:%d|B:%d",
                 THIS_NODE_ADDRESS, txSequenceNum,
                 temperature, humidity, batteryMV);
    }

    int payloadLen = strlen(payload);

    uint8_t encrypted[payloadLen + 2];
    xorEncrypt(payload, payloadLen, encrypted);

    uint16_t crc = calculateCRC16(encrypted, payloadLen);
    encrypted[payloadLen] = (crc >> 8) & 0xFF;
    encrypted[payloadLen + 1] = crc & 0xFF;
    uint8_t encLen = payloadLen + 2;

    uint8_t totalLen = 4 + encLen;
    uint8_t packet[totalLen];
    packet[0] = BROADCAST_ADDRESS;
    packet[1] = THIS_NODE_ADDRESS;
    packet[2] = rhMsgId++;
    packet[3] = FLAG_ACK_REQ;  // hop=0, ack_req=1 (origin)
    memcpy(&packet[4], encrypted, encLen);

    // Apply adaptive radio params before TX
    // ใช้ ACK feedback + silence timeout + RSSI
    if (adaptiveRadio) {
        uint8_t pwr;
        if (millis() - lastHeardTime > SILENCE_TIMEOUT_MS) {
            // เงียบเกิน 5 นาที → อาจไม่มีใครได้ยินเรา → ส่งแรงสุด
            pwr = ADAPTIVE_POWER_MAX;
            dbg("ADAPT: silence timeout → max power");
        } else if (lastTxAcked) {
            // TX ครั้งก่อนมี ACK กลับ → ใช้ RSSI-based power
            int16_t refRssi = (lastRxValid && lastRxRssi < 0) ? lastRxRssi : rssiSourceClose;
            pwr = rssiToTxPower(refRssi);
            dbgf("ADAPT: ACK OK → %d dBm", pwr);
        } else if (txSequenceNum % PROBE_INTERVAL == 0) {
            // Probe: ส่งแรงสุดทุก 10 ครั้งเพื่อประกาศตัว
            pwr = ADAPTIVE_POWER_MAX;
            dbg("ADAPT: probe → max power");
        } else {
            // ไม่มี ACK → คง power เดิมหรือเพิ่มตาม RSSI
            int16_t refRssi = (lastRxValid && lastRxRssi < 0) ? lastRxRssi : rssiSourceClose;
            pwr = rssiToTxPower(refRssi);
            if (pwr < currentTxPower) pwr = currentTxPower;  // ไม่ลด
            dbgf("ADAPT: no ACK → hold %d dBm", pwr);
        }
        applyRadioParams(pwr);
        lastTxAcked = false;  // reset รอ ACK ครั้งนี้
    }

    // Standby → Buffer → TX
    bool sent = false;
#ifdef USE_SX1262
    sx1262SetStandby();
    delay(2);
    uint8_t pktParams[6] = {0x00, 0x08, 0x00, (uint8_t)totalLen, 0x01, 0x00};
    sx1262WriteCommand(0x8C, pktParams, 6);
    sx1262WriteBuffer(0x00, packet, totalLen);
    sx1262ClearIrqStatus();
    uint8_t txP[3] = {0x00, 0x00, 0x00};
    sx1262WriteCommand(0x83, txP, 3);
    { uint32_t txStart = millis();
    while (millis() - txStart < 2000) {
        uint16_t irq = sx1262GetIrqStatus();
        if (irq & 0x0001) { sx1262ClearIrqStatus(); sent = true; break; }
        delay(1);
    } }
#endif
#ifdef USE_RFM95
    rfm95WriteReg(RFM95_REG_OPMODE, RFM95_MODE_STANDBY);
    delay(2);
    rfm95WriteReg(RFM95_REG_FIFO_ADDR_PTR, 0x00);
    rfm95WriteBurst(RFM95_REG_FIFO, packet, totalLen);
    rfm95WriteReg(RFM95_REG_PAYLOAD_LEN, totalLen);
    rfm95WriteReg(RFM95_REG_IRQ_FLAGS, 0xFF);
    rfm95WriteReg(RFM95_REG_OPMODE, RFM95_MODE_TX);
    { uint32_t txStart = millis();
    while (millis() - txStart < 2000) {
        if (rfm95ReadReg(RFM95_REG_IRQ_FLAGS) & RFM95_IRQ_TX_DONE) {
            rfm95WriteReg(RFM95_REG_IRQ_FLAGS, 0xFF);
            sent = true; break;
        }
        delay(1);
    } }
#endif
    setModeRx();

    if (sent) {
        dbgf("TX S:%d OK", txSequenceNum);
    } else {
        dbg("TX: timeout!");
    }

    ownTxAttempted = true;
    lastOwnTxOk = sent;
    txSequenceNum++;
    updateOLED();
}

// ============ LORA RX (RadioHead compatible) ============
void receivePacket() {
    if (!lora_ok || !lora_rx_flag) return;
    lora_rx_flag = false;

    uint8_t rxLen = 0;
    int16_t rssi = 0;
    uint8_t packet[MAX_MESSAGE_LEN + 4];

#ifdef USE_SX1262
    uint16_t irqFlags = sx1262GetIrqStatus();
    bool sx1262CrcFail = (irqFlags & 0x0040);
    if (!(irqFlags & 0x0002)) {
        sx1262ClearIrqStatus();
        setModeRx();
        return;
    }
    uint8_t rxStatus[2];
    sx1262ReadCommand(0x13, rxStatus, 2);
    rxLen = rxStatus[0];
    uint8_t rxStartAddr = rxStatus[1];
    if (rxLen < 7 || rxLen > MAX_MESSAGE_LEN) {
        sx1262ClearIrqStatus(); setModeRx(); return;
    }
    sx1262ReadBuffer(rxStartAddr, packet, rxLen);
    uint8_t pktStatus[3];
    sx1262ReadCommand(0x14, pktStatus, 3);
    rssi = -(int16_t)pktStatus[0] / 2;
    if (sx1262CrcFail) {
        // Log CRC-failed packet with RSSI only
        logRssiSample(0, 0, 0, rssi, 0, RELAY_STATUS_DROP_CRC, RSSI_LOG_FLAG_CRC_FAIL);
        sx1262ClearIrqStatus();
        setModeRx();
        return;
    }
#endif

#ifdef USE_RFM95
    uint8_t irqFlags = rfm95ReadReg(RFM95_REG_IRQ_FLAGS);
    bool rfm95CrcFail = (irqFlags & RFM95_IRQ_CRC_ERROR);
    if (!(irqFlags & RFM95_IRQ_RX_DONE)) {
        rfm95WriteReg(RFM95_REG_IRQ_FLAGS, 0xFF);
        setModeRx();
        return;
    }
    rxLen = rfm95ReadReg(RFM95_REG_RX_NB_BYTES);
    if (rxLen < 7 || rxLen > MAX_MESSAGE_LEN) {
        rfm95WriteReg(RFM95_REG_IRQ_FLAGS, 0xFF); setModeRx(); return;
    }
    rfm95WriteReg(RFM95_REG_FIFO_ADDR_PTR, rfm95ReadReg(RFM95_REG_FIFO_RX_CURR));
    rfm95ReadBurst(RFM95_REG_FIFO, packet, rxLen);
    rssi = (int16_t)rfm95ReadReg(RFM95_REG_PKT_RSSI) - 157;
    if (rfm95CrcFail) {
        // Log CRC-failed packet with RSSI only
        logRssiSample(0, 0, 0, rssi, 0, RELAY_STATUS_DROP_CRC, RSSI_LOG_FLAG_CRC_FAIL);
        rfm95WriteReg(RFM95_REG_IRQ_FLAGS, 0xFF);
        setModeRx();
        return;
    }
#endif

    // Parse RadioHead header
    uint8_t rhTo    = packet[0];
    uint8_t rhFrom  = packet[1];
    uint8_t rhFlags = packet[3];
    uint8_t hopCount = rhFlags & 0x0F;

    if (rhTo != BROADCAST_ADDRESS && rhTo != THIS_NODE_ADDRESS) {
        setModeRx();
        return;
    }

