worrajak/nRF52840/nRF52840_vault/3_Resources/Refs/main.cpp
    // ---- Relay logic ----
    // Guard: skip if this is our own data (echo from another relay)
    if (srcNode == THIS_NODE_ADDRESS || rhFrom == THIS_NODE_ADDRESS) {
        strncpy(lastRelayStatus, "DROP-ECHO", sizeof(lastRelayStatus));
        dbgf("RX: own echo N:%d skip", srcNode);
    } else if (isAck && ackSrcNode == THIS_NODE_ADDRESS) {
        // ACK is for us — don't relay further
        lastTxAcked = true;  // ACK feedback — TX ครั้งก่อนถึง
        strncpy(lastRelayStatus, "ACK-RCVD", sizeof(lastRelayStatus));
        dbgf("RX: ACK for us N:%d S:%d", ackSrcNode, ackSeqNum);
    } else if (isAck && ackSrcNode == 0) {
        // Malformed ACK — can't determine original source
        strncpy(lastRelayStatus, "DROP-ACK", sizeof(lastRelayStatus));
        dbg("RX: bad ACK skip");
    } else if (srcNode == 0 && !isAck) {
        strncpy(lastRelayStatus, "DROP-PARSE", sizeof(lastRelayStatus));
        dbg("RX: bad parse skip");
    } else {
        // For ACKs: use (ackSrcNode, ackSeqNum) for duplicate check
        // to avoid collision with the original data packet's cache entry
        uint8_t dupSrc = isAck ? ackSrcNode : srcNode;
        uint8_t dupSeq = isAck ? ackSeqNum : seqNum;

        if (isMessageDuplicate(dupSrc, dupSeq)) {
            strncpy(lastRelayStatus, "DROP-DUP", sizeof(lastRelayStatus));
            dbg("RX: dup skip");
        } else {
            addToRelayCache(dupSrc, dupSeq);

            if (hopCount < MAX_HOPS) {
                // Decision logic:
                //   ML mode: predictRelay() uses trained neural network
                //   Rule mode: hop=0 (origin) → relay only if RSSI < adaptive threshold
                bool shouldRelay = true;
                
                if (mlMode) {
                    // ML-based decision using 3-layer neural network
                    float raw[4] = { (float)rssi, (float)srcNode, (float)rhFrom, (float)THIS_NODE_ADDRESS };
                    float prob = mlPredictRelay(raw);
                    mlProbPct = (uint8_t)(prob * 100.0f);
                    if (prob < 0.5f) {
                        shouldRelay = false;
                        strncpy(lastRelayStatus, "NO-RELAY", sizeof(lastRelayStatus));
                        dbgf("ML: skip R:%d prob:%d%% N:%d", rssi, mlProbPct, srcNode);
                    } else {
                        dbgf("ML: relay R:%d prob:%d%% N:%d", rssi, mlProbPct, srcNode);
                    }
                } else {
                    // Rule-based: source close → skip relay
                    if (hopCount == 0 && rssi >= rssiSourceClose) {
                        shouldRelay = false;
                        strncpy(lastRelayStatus, "NO-RELAY", sizeof(lastRelayStatus));
                        dbgf("RX: src close R:%d thresh:%d N:%d skip relay",
                             rssi, rssiSourceClose, srcNode);
                    }
                }

                if (shouldRelay) {
                    uint8_t relayPkt[rxLen];
                    memcpy(relayPkt, packet, rxLen);
                    relayPkt[0] = BROADCAST_ADDRESS;
                    relayPkt[1] = THIS_NODE_ADDRESS;
                    relayPkt[2] = rhMsgId++;
                    // Preserve FLAGS bits 4-5 (IS_ACK, ACK_REQ) while incrementing hop
                    relayPkt[3] = ((hopCount + 1) & FLAG_HOP_MASK) |
                                  (rhFlags & ~FLAG_HOP_MASK);
                    addToMessageQueue(relayPkt, rxLen, dupSrc, dupSeq, rssi);
                    dbgf("FWD N:%d S:%d H:%d>%d R:%d%s",
                         dupSrc, dupSeq, hopCount, hopCount + 1, rssi,
                         isAck ? " ACK" : "");
                }
            } else {
                strncpy(lastRelayStatus, "DROP-HOP", sizeof(lastRelayStatus));
                dbgf("RX: maxhop %d N:%d", hopCount, srcNode);
            }
        }
    }

// Record final decision in RSSI log
    updateLastLogDecision();

#ifdef USE_SX1262
    sx1262ClearIrqStatus();
#endif
#ifdef USE_RFM95
    rfm95WriteReg(RFM95_REG_IRQ_FLAGS, 0xFF);
#endif
    setModeRx();
    updateOLED();
}

// ============ BATTERY ============
float readBattery() {
    analogReadResolution(12);
    uint16_t raw = analogRead(BATTERY_PIN);
    return (raw * REAL_VBAT_MV_PER_LSB) / 1000.0f;
}

// ============ I2C SCAN ============
void scanI2C() {
    uint8_t count = 0;
    for (uint8_t addr = 1; addr < 127; addr++) {
        Wire.beginTransmission(addr);
        if (Wire.endTransmission() == 0) {
            dbgf("I2C: 0x%02X found", addr);
            count++;
        }
    }
    dbgf("I2C: %d device(s)", count);
}

// ============ SETUP ============
void setup() {
    pinMode(STATUS_LED, OUTPUT);
    digitalWrite(STATUS_LED, LOW);
    nrf_gpio_cfg_input(UI_BUTTON_PIN, NRF_GPIO_PIN_PULLUP);

    Serial.begin(115200);
    delay(2000);
#ifdef USE_SX1262
    Serial.print(F("\n=== nRF52840 LoRa P2P Node "));
    Serial.print(THIS_NODE_ADDRESS);
    Serial.println(F(" (SX1262+BLE) ==="));
#endif
#ifdef USE_RFM95
    Serial.print(F("\n=== nRF52840 LoRa P2P Node "));
    Serial.print(THIS_NODE_ADDRESS);
    Serial.println(F(" (RFM95+BLE) ==="));
#endif

    // I2C
    Wire.setPins(OLED_SDA, OLED_SCL);
    Wire.begin();
    delay(100);

    // OLED
    if (!display.begin(SSD1306_SWITCHCAPVCC, 0x3C)) {
        if (!display.begin(SSD1306_SWITCHCAPVCC, 0x3D)) {
            Serial.println(F("[-] OLED FAILED"));
        } else {
            oled_ok = true;
        }
    } else {
        oled_ok = true;
    }

    if (oled_ok) {
        display.clearDisplay();
        display.setTextSize(2);
        display.setTextColor(SSD1306_WHITE);
        display.setCursor(0, 0);
        display.print(F("Node "));
        display.println(THIS_NODE_ADDRESS);
        display.setTextSize(1);
#ifdef USE_SX1262
        display.println(F("SX1262+BLE init..."));
#endif
#ifdef USE_RFM95
        display.println(F("RFM95+BLE init..."));
#endif
        display.display();
    }

    dbgf("=== Node %d ===", THIS_NODE_ADDRESS);
    dbg(oled_ok ? "OLED: OK" : "OLED: FAIL!");
    updateOLED();

    scanI2C();
    updateOLED();

    // BME280 init
    if (bme.begin(0x76)) {
        bme_ok = true;
    } else if (bme.begin(0x77)) {
        bme_ok = true;
    }
    if (bme_ok) {
        bme.setSampling(Adafruit_BME280::MODE_FORCED,
                        Adafruit_BME280::SAMPLING_X1,
                        Adafruit_BME280::SAMPLING_NONE,
                        Adafruit_BME280::SAMPLING_X1,
                        Adafruit_BME280::FILTER_OFF);
        dbg("BME280: OK");
    } else {
        dbg("BME280: sim mode");
    }
    updateOLED();

    // BLE init (must be before LoRa — NimBLE needs early radio init)
    ble_ok = initBLE();
    dbg(ble_ok ? "BLE: OK" : "BLE: FAIL!");
    updateOLED();

    // LoRa init
    lora_ok = initLoRa();
    if (!lora_ok) {
#ifdef USE_SX1262
        dbg("SX1262: FAILED!");
#endif
#ifdef USE_RFM95
        dbg("RFM95: FAILED!");
#endif
    }
    updateOLED();

    dbg("Ready.");
    updateOLED();

    digitalWrite(STATUS_LED, HIGH);
    delay(1000);
}

// ============ LOOP ============
void loop() {
    static unsigned long lastBat = 0;
    static unsigned long lastDisplay = 0;
    static unsigned long lastTx = 0;

    handleUIButton();
    handleSerialCommand();

    // RX has priority
    receivePacket();

    // Process relay queue
    processMessageQueue();

    // Battery + BME280 every 2s
    if (millis() - lastBat >= 2000) {
        lastBat = millis();
        batteryVoltage = readBattery();
        batteryMV = (uint16_t)(batteryVoltage * 1000);
        if (bme_ok) {
            bme.takeForcedMeasurement();
            temperature = (int16_t)bme.readTemperature();
            humidity = (int16_t)bme.readHumidity();
        }
    }

    // Update OLED every 1s
    if (millis() - lastDisplay >= 1000) {
        lastDisplay = millis();
        updateOLED();
    }

    // TX every 2 minutes
    if (lora_ok && millis() - lastTx >= TX_INTERVAL) {
        lastTx = millis();
        sendPacket();
    }

#if LOW_POWER_IDLE
    // This blocks only the application loop task. The nRF52840 enters
    // System-ON idle while SX1262 remains in continuous RX and OLED stays on.
    // DIO1 wakes the CPU; button polling resumes within 10 ms.
    delay(CPU_IDLE_SLEEP_MS);
#else
    yield();
#endif
}
